Repository: PavelDemyanov/EUCtelemetry
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: News
ru: Новости

source: Posted by %(author)s on %(date)s
ru: Опубликовано %(date)s пользователем %(author)s

source: For WheelLog:
ru: Из WheelLog:

source: Open the WheelLog app
ru: Откройте приложение WheelLog

source: Scroll right until your trip list appears
ru: Листайте экраны вправо до появления списка ваших поездок

source: Tap on the trip dropdown icon
ru: Нажмите на иконку выпадающего списка поездки

source: Tap "Share" to save the trip as a CSV
ru: Нажмите "поделиться" что бы сохранить CSV поездки

source: pending
ru: в ожидании

source: Pending
ru: В ожидании

source: processing
ru: обработка

source: Processing
ru: Обработка

source: completed
ru: завершено

source: Completed
ru: Завершено

source: error
ru: ошибка

source: Error
ru: Ошибка

source: stopped
ru: остановлено

source: Stopped
ru: Остановлено

source: Telemetry Elements Visibility
ru: Отображение элементов телеметрии

source: Speed
ru: Скорость

source: Max Speed
ru: Максимальная скорость

source: Voltage
ru: Напряжение

source: Temperature
ru: Температура

source: Battery
ru: Батарея

source: Mileage
ru: Пробег

source: PWM
ru: ШИМ

source: Power
ru: Мощность

source: Bottom Elements (Arc and Speed)
ru: Нижние элементы (Дуга и скорость)

source: Please check your email to complete registration.
ru: Пожалуйста, проверьте вашу почту для завершения регистрации.

source: Error sending confirmation email. Please try registering again.
ru: Ошибка при отправке письма для подтверждения. Пожалуйста, попробуйте зарегистрироваться снова.

source: An error occurred during registration. Please try again later.
ru: Произошла ошибка при регистрации. Пожалуйста, попробуйте позже.

source: Invalid confirmation link.
ru: Неверная ссылка подтверждения.

source: This confirmation link has expired. Please register again.
ru: Срок действия этой ссылки подтверждения истек. Пожалуйста, зарегистрируйтесь снова.

source: Your email has been confirmed! You can now log in.
ru: Ваш email подтвержден! Теперь вы можете войти в систему.

source: Sign In
ru: Войти

source: Password
ru: Пароль

source: Forgot password?
ru: Забыли пароль?

source: Don't have an account?
ru: Нет аккаунта?

source: Register
ru: Регистрация

source: Registration
ru: Регистрация

source: Confirm Password
ru: Подтвердите пароль

source: Already have an account?
ru: Уже есть аккаунт?

source: Sign in
ru: Войти

source: Set New Password
ru: Установить новый пароль

source: Reset Password
ru: Сбросить пароль

source: Remember your password?
ru: Вспомнили пароль?

source: Send Reset Link
ru: Отправить ссылку для сброса

source: New Password
ru: Новый пароль

source: Confirm New Password
ru: Подтвердите новый пароль

source: Current Password
ru: Текущий пароль

source: Change Password
ru: Изменить пароль

source: Save Changes
ru: Сохранить изменения

source: Delete Account
ru: Удалить аккаунт

source: Passwords must match
ru: Пароли должны совпадать

source: Password must be at least 6 characters long
ru: Пароль должен быть не менее 6 символов

source: Profile Settings
ru: Настройки профиля

source: Email cannot be changed
ru: Электронную почту нельзя изменить

source: Preferred Language
ru: Предпочитаемый язык

source: Warning!
ru: Внимание!

source: This action cannot be undone. All your data will be permanently deleted.
ru: Это действие нельзя отменить. Все ваши данные будут удалены безвозвратно.

source: Are you sure you want to delete your account? This action cannot be undone.
ru: Вы уверены, что хотите удалить свой аккаунт? Это действие нельзя отменить.

source: Profile updated successfully
ru: Профиль успешно обновлен

source: EUCTelemetry Icon
ru: Иконка EUCTelemetry

source: Home
ru: Главная

source: Create
ru: Создать

source: Create Project
ru: Создать проект

source: My Projects
ru: Проекты

source: About
ru: О программе

source: Admin
ru: Админ

source: Language
ru: Язык

source: Profile
ru: Профиль

source: Logout
ru: Выйти

source: Login
ru: Войти

source: Transform your EUC ride videos with professional telemetry overlays.
ru: Преобразуйте ваши видео поездок на моноколесе с помощью профессиональных наложений телеметрии.

source: Quick Links
ru: Быстрые ссылки

source: Connect
ru: Связаться

source: EUCTelemetry. Created by Pavel Demyanov. All rights reserved.
ru: EUCTelemetry. Создано Павлом Демьяновым. Все права защищены.

source: The program is designed to extract telemetry data (speed, PWM, GPS speed, power, current, voltage, battery charge, trip mileage, temperature) from popular programs like <strong>DarknessBot</strong> and <strong>WheelLog</strong> and overlay them on a blue background (chroma key) for further integration of telemetry data onto your video recorded during a trip or from cameras such as <strong>insta360</strong>, <strong>GoPro</strong>, <strong>iPhone</strong>, or any other camera.
ru: Программа предназначена для извлечения данных телеметрии (скорость, ШИМ, GPS скорость, мощность, ток, напряжение, заряд батареи, пробег, температура) из популярных программ, таких как <strong>DarknessBot</strong> и <strong>WheelLog</strong>, и наложения их на синий фон (хромакей) для дальнейшего наложения данных телеметрии на ваше видео, записанное во время поездки с камер, таких как <strong>insta360</strong>, <strong>GoPro</strong>, <strong>iPhone</strong> или любой другой камеры.

source: How to Export Telemetry Data
ru: Как экспортировать данные телеметрии

source: From DarknessBot:
ru: Из DarknessBot:

source: Open DarknessBot and go to the "Trips" section
ru: Откройте DarknessBot и перейдите в раздел "Поездки"

source: Select the desired "Trip"
ru: Выберите нужную "Поездку"

source: Click the export button
ru: Нажмите кнопку экспорта

source: Save the CSV file of the trip to a convenient location
ru: Сохраните CSV файл поездки в удобное место

source: Your browser does not support the video tag.
ru: Ваш браузер не поддерживает тег видео.

source: From WheelLog:
ru: Из WheelLog:

source: Open WheelLog and go to the section
ru: Откройте WheelLog и перейдите в раздел

source: Additional steps
ru: Дополнительные шаги

source: Running the Program
ru: Запуск программы

source: Open the CSV file
ru: Откройте CSV файл

source: Choose the desired FPS, resolution (FullHD or 4K), and codec settings
ru: Выберите желаемые настройки FPS, разрешения (FullHD или 4K) и кодека

source: Set up the display of telemetry elements on the video
ru: Настройте отображение элементов телеметрии на видео

source: Start the process of creating a video on the blue background (Chroma Key)
ru: Запустите процесс создания видео на синем фоне (Хромакей)

source: Go to the "My Projects" section to download the finished video
ru: Перейдите в раздел "Мои проекты" для загрузки готового видео

source: Overlaying on Your Trip Video from iPhone, insta360, GoPro, and Other Cameras
ru: Наложение на видео вашей поездки с iPhone, insta360, GoPro и других камер

source: You can use any video editor that supports chroma key removal, such as <a href="https://www.blackmagicdesign.com/products/davinciresolve" target="_blank">Davinci Resolve</a>
ru: Вы можете использовать любой видеоредактор, поддерживающий удаление хромакея, например <a href="https://www.blackmagicdesign.com/products/davinciresolve" target="_blank">Davinci Resolve</a>

source: Open your camera video in Davinci Resolve
ru: Откройте видео с вашей камеры в Davinci Resolve

source: Overlay the video created by euctelemetry.app on top
ru: Наложите видео, созданное euctelemetry.app, сверху

source: Apply the 3D keyer effect to the video from euctelemetry.app
ru: Примените эффект 3D keyer к видео из euctelemetry.app

source: Align the telemetry data with your trip on the timeline
ru: Выровняйте данные телеметрии с вашей поездкой на временной шкале

source: Export the video with your desired quality settings
ru: Экспортируйте видео с желаемыми настройками качества

source: About the Creator
ru: О создателе

source: Pavel Demyanov
ru: Павел Демьянов

source: About EUCtelemetry
ru: О EUCtelemetry

source: EUCtelemetry is an application designed to process and visualize Electric Unicycle telemetry data, creating professional-looking overlays for your ride videos. As the creator of this tool, I'm committed to helping the EUC community enhance their riding content.
ru: EUCtelemetry - это приложение, разработанное для обработки и визуализации данных телеметрии электрических моноколес, создающее профессионально выглядящие наложения для ваших видео поездок. Как создатель этого инструмента, я стремлюсь помочь сообществу EUC улучшить качество их контента.

source: Contact Information
ru: Контактная информация

source: Open Source
ru: Открытый исходный код

source: The application is open source and available on GitHub. You can download, fork, or distribute it according to the license terms. I appreciate attribution when you use or modify the software.
ru: Приложение имеет открытый исходный код и доступно на GitHub. Вы можете скачать, форкнуть или распространять его в соответствии с условиями лицензии. Я буду признателен за указание авторства при использовании или модификации программного обеспечения.

source: Access the GitHub Repository
ru: Перейти в репозиторий GitHub

source: Projects
ru: Проекты

source: Created
ru: Создано

source: Type
ru: Тип

source: Status
ru: Статус

source: Frames
ru: Кадры

source: Codec
ru: Кодек

source: Duration
ru: Длит.

source: Proc. Time
ru: Обработ.

source: Expires In
ru: Истекает

source: Actions
ru: Действия

source: Video
ru: Видео

source: Stop
ru: Остановить

source: Delete
ru: Удалить

source: Previous
ru: Предыдущая

source: Next
ru: Следующая

source: Create New Project
ru: Создать новый проект

source: Project Name
ru: Название проекта

source: Leave empty for auto-generation
ru: Оставьте пустым для автоматической генерации

source: Project name can only contain letters and numbers (max 7 characters)
ru: Название проекта может содержать только буквы и цифры (макс. 7 символов)

source: CSV File
ru: CSV файл

source: Fast
ru: Быстро

source: Slow
ru: Медленно

source: Medium
ru: Средне

source: Video Codec
ru: Видеокодек

source: Interpolate Missing Values
ru: Интерполировать отсутствующие значения

source: Two-way interpolation
ru: Двухсторонняя интерполяция

source: Automatically fill missing values using two-way interpolation
ru: Автоматически заполнять пропущенные значения используя двухстороннюю интерполяцию

source: Upload and Show Preview
ru: Загрузить и показать предпросмотр

source: Preview
ru: Предпросмотр

source: Text Display Settings
ru: Настройки отображения текста

source: Vertical Position
ru: Вертикальное положение

source: Corner Radius
ru: Радиус углов

source: Box Width
ru: Ширина блока

source: Box Height
ru: Высота блока

source: Spacing Between Items
ru: Расстояние между элементами

source: Font Size
ru: Размер шрифта

source: Speed Indicator Display Settings
ru: Настройки отображения индикатора скорости

source: Indicator Scale
ru: Масштаб индикатора

source: Indicator Horizontal Position
ru: Горизонтальное положение индикатора

source: Indicator Vertical Position
ru: Вертикальное положение индикатора

source: Speed Value Size
ru: Размер значения скорости

source: Speed Text Vertical Offset
ru: Вертикальное смещение текста скорости

source: Unit Text Size
ru: Размер текста единиц измерения

source: Unit Text Vertical Offset
ru: Вертикальное смещение текста единиц измерения

source: Start Processing
ru: Начать обработку

source: Processing...
ru: Обработка...

source: You can close your browser and come back later - the video processing will continue in the background.
ru: Вы можете закрыть браузер и вернуться позже - обработка видео продолжится в фоновом режиме.

source: Alternatively, you can go to the Projects section to monitor the progress there.
ru: Кроме того, вы можете перейти в раздел Проекты, чтобы отслеживать прогресс там.

source: Current:
ru: Текущее:

source: px
ru: пх

source: Creating frames...
ru: Создание кадров...

source: Processing video...
ru: Обработка видео...

source: Analyzing CSV data...
ru: Анализ CSV данных...

source: Generating preview...
ru: Создание предпросмотра...

source: Initializing...
ru: Инициализация...

source: Preview frame
ru: Кадр предпросмотра

source: Preset Controls
ru: Управление пресетами

source: Reset to Defaults
ru: Сбросить к значениям по умолчанию

source: Save as Preset
ru: Сохранить как пресет

source: Select a Preset
ru: Выбрать пресет

source: Delete Preset
ru: Удалить пресет

source: Trim CSV Data
ru: Обрезка данных CSV

source: Drag the blue and orange markers on the chart below to trim your CSV data. This will reduce file size and video length.
ru: Перетащите синие и оранжевые маркеры на графике ниже, чтобы обрезать данные CSV. Это уменьшит размер файла и длительность видео.

source: Total Records:
ru: Всего записей:

source: Trim Data
ru: Обрезать данные

source: Trimming...
ru: Обрезка...

source: Complete!
ru: Завершено!

source: Creating frames... Complete!
ru: Создание кадров... Завершено!

source: Processing video... Complete!
ru: Обработка видео... Завершено!

source: Analyzing CSV data... Complete!
ru: Анализ CSV данных... Завершено!

source: Generating preview... Complete!
ru: Создание предпросмотра... Завершено!

source: Uploading CSV...
ru: Загрузка CSV...

source: Uploading CSV... Complete!
ru: Загрузка CSV... Завершено!

source: Current status:
ru: Текущий статус:

source: Waiting to start...
ru: Ожидание начала...

source: Encoding video...
ru: Кодирование видео...

source: Error:
ru: Ошибка:

source: No status received from server
ru: Не получен статус от сервера

source: Processing failed
ru: Обработка не удалась

source: An error occurred during video processing.
ru: Произошла ошибка при обработке видео.

source: Error: Unexpected status
ru: Ошибка: Неожиданный статус

source: An unexpected error occurred.
ru: Произошла непредвиденная ошибка.

source: Error checking status:
ru: Ошибка при проверке статуса:

source: An error occurred while checking the processing status.
ru: Произошла ошибка при проверке статуса обработки.

source: An error occurred while starting the video processing.
ru: Произошла ошибка при запуске обработки видео.

source: Video processing completed successfully!
ru: Обработка видео успешно завершена!

source: Are you sure you want to stop and delete this project?
ru: Вы уверены, что хотите остановить и удалить этот проект?

source: Error stopping project:
ru: Ошибка при остановке проекта:

source: Error stopping project
ru: Ошибка при остановке проекта

source: Are you sure you want to delete this project?
ru: Вы уверены, что хотите удалить этот проект?

source: Error deleting project:
ru: Ошибка при удалении проекта:

source: Error deleting project
ru: Ошибка при удалении проекта

source: Create News
ru: Создать новость

source: Edit News
ru: Редактировать новость

source: Title
ru: Заголовок

source: Content
ru: Содержание

source: Save News
ru: Сохранить новость

source: Edit
ru: Редактировать

source: Are you sure you want to delete this news?
ru: Вы уверены, что хотите удалить эту новость?

source: Page %(current)s of %(total)s
ru: Страница %(current)s из %(total)s

source: News created successfully
ru: Новость успешно создана

source: News updated successfully
ru: Новость успешно обновлена

source: News deleted successfully
ru: Новость успешно удалена

source: You can use Markdown syntax
ru: Вы можете использовать синтаксис Markdown

source: Cancel
ru: Отмена

source: Title must be between 1 and 200 characters
ru: Заголовок должен быть от 1 до 200 символов

source: Analytics
ru: Аналитика

source: EUC Data Analytics
ru: Аналитика данных моноколеса

source: Upload your data
ru: Загрузите ваши данные

source: Trip Telemetry
ru: Телеметрия поездки

source: Adaptive Chart
ru: Адаптивный график

source: (normalizes values for better visualization)
ru: (нормализует значения для лучшей визуализации)

source: Reset Zoom
ru: Сбросить масштаб

source: Click on legend items to show or hide each chart
ru: Нажмите на элементы легенды, чтобы показать или скрыть каждый график

source: Loading...
ru: Загрузка...

source: Processing data...
ru: Обработка данных...

source: Time
ru: Время

source: Values
ru: Значения

source: Unknown
ru: Неизвестно

source: Invalid time
ru: Неверное время

source: Please select a CSV file
ru: Пожалуйста, выберите CSV файл

source: Error parsing CSV data:
ru: Ошибка при разборе данных CSV:

source: Received invalid data format from server
ru: Получен неверный формат данных от сервера

source: An error occurred while processing the file
ru: Произошла ошибка при обработке файла

source: Could not load the specified file
ru: Не удалось загрузить указанный файл

source: No file provided
ru: Файл не предоставлен

source: No file selected
ru: Файл не выбран

source: File is too large. Please upload a CSV file smaller than 50MB.
ru: Файл слишком большой. Пожалуйста, загрузите CSV файл размером менее 50МБ.

source: speed
ru: скорость

source: voltage
ru: напряжение

source: temperature
ru: температура

source: current
ru: ток

source: battery
ru: батарея

source: mileage
ru: пробег

source: pwm
ru: шим

source: power
ru: мощность

source: km/h
ru: км/ч

source: V
ru: В

source: A
ru: А

source: km
ru: км

source: W
ru: Вт

source: Too many registration attempts from your IP address. Please try again tomorrow.
ru: Слишком много попыток регистрации с вашего IP-адреса. Попробуйте снова завтра.

source: Please complete the CAPTCHA verification
ru: Пожалуйста, пройдите проверку CAPTCHA

source: CAPTCHA verification failed. Please try again.
ru: Проверка CAPTCHA не удалась. Попробуйте снова.

source: 15 (real fps 14.985)
ru: 15 (реальная частота 14.985)

source: 30 (real fps 29.97)
ru: 30 (реальная частота 29.97)

source: 60 (real fps 59.94)
ru: 60 (реальная частота 59.94)

source: Static Box Size
ru: Статичный размер блоков

source: Keep box sizes consistent based on maximum text width
ru: Сохранять размеры блоков постоянными на основе максимальной ширины текста

source: Icons instead of text
ru: Иконки вместо текста

source: Icon Vertical Position
ru: Вертикальное положение иконок

source: Adjust icon position relative to text
ru: Настроить положение иконок относительно текста

source: Archive is too large for download (%(size).1f MB). Maximum allowed size is 100 MB. Please reduce the number of frames or video duration.
ru: Архив слишком большой для скачивания (%(size).1f МБ). Максимальный размер 100 МБ. Пожалуйста, уменьшите количество кадров или продолжительность видео.

source: Archive is too large for download (>100 MB). Please reduce the number of frames or video duration.
ru: Архив слишком большой (>100 МБ). Уменьшите количество кадров или продолжительность.

source: Too Large
ru: Слишком большой
